package 과제.level4;

public class Level4_1 {
    /*
    1. 객체는 클래스에 의해 정의되고 설계된 내용을 기반으로 생성된다.
       객체는 멤버변수와 기능을 수행하는 메소드로 이루어진다.
       메소드를 통하여 다른 객체와 상호작용/협력 할 수 있다.
       객체가 생성될 때마다 다른 객체와 구별하기 위해 새로운 주소에 저장된다.

    2. 클래스는 객체를 만들기 위한 설계도이다.
       멤버변수, 생성자, 메소드로 구성되어 있다.

    3. 멤버변수는 클래스 내부에 선언된 변수를 말한다.
       객체가 생성될 때 각각의 객체에 별도의 공간을 할당받으며, 객체의 상태를 나타내는
       데이터를 저장한다.
       클래스의 모든 메소드에서 사용 가능하다.
       접근 제어자를 사용하여 접근 범위를 제어하고, 알맞은 타입을 지정하여 오류를 줄인다.

    4. 멤버변수는 클래스 내부에 선언되고, 힙 메모리에 저장된다.
       지역변수는 메소드내에서 선언되며 메소드 실행이 끝나면 소멸되고, 스택 메모리에 저장된다.
       멤버변수는 자동으로 초기화되지 않으며,초기화하지 않은 경우 해당 변수는 기본값으로 초기화된다.
       지역변수는 메소드내에서 사용하기 전에 반드시 초기화해야 오류가 발생하지 않는다.
       멤버변수는 접근 제어자를 사용해 접근 범위를 제어할 수 있다.
       지역변수는 메소드 내에서만 유효하기 때문에 외부에서 접근할 수 없다.

    */

}
